{
    "title": "Grade 5 Human Body Terms Set 2",
    "questions": [
        {
            "id": "1",
            "word": "Arteries",
            "definition": "Blood vessels that carry oxygen-rich blood away from the heart to the rest of the body. Example: These vessels are often felt as a pulse in your wrist."
        },
        {
            "id": "2",
            "word": "Veins",
            "definition": "Blood vessels that carry blood back to the heart. Example: These vessels are often visible under the skin."
        },
        {
            "id": "3",
            "word": "Capillaries",
            "definition": "The smallest blood vessels where oxygen and nutrients are exchanged with cells. Example: These connect arteries to veins."
        },
        {
            "id": "4",
            "word": "Alveoli",
            "definition": "Tiny air sacs in the lungs where oxygen is transferred to the blood. Example: These structures look like little clusters of grapes."
        },
        {
            "id": "5",
            "word": "Red Blood Cells",
            "definition": "Cells in the blood that transport oxygen to the body's tissues. Example: These cells contain a protein called hemoglobin."
        },
        {
            "id": "6",
            "word": "Plasma",
            "definition": "The liquid part of blood that carries nutrients, hormones, and waste products. Example: It makes up more than half of the blood’s volume."
        },
        {
            "id": "7",
            "word": "Esophagus",
            "definition": "The muscular tube that moves food from the mouth to the stomach. Example: This tube contracts in a wave-like motion called peristalsis."
        },
        {
            "id": "8",
            "word": "Small Intestine",
            "definition": "A long, coiled tube where most digestion and nutrient absorption occurs. Example: This organ is about 6 meters long in adults."
        },
        {
            "id": "9",
            "word": "Large Intestine",
            "definition": "The organ where water is absorbed and solid waste is formed. Example: It surrounds the small intestine like a frame."
        },
        {
            "id": "10",
            "word": "Liver",
            "definition": "A large organ that produces bile to help digest fats and detoxifies the blood. Example: This organ is located on the right side of the abdomen."
        },
        {
            "id": "11",
            "word": "Pancreas",
            "definition": "An organ that produces enzymes for digestion and hormones like insulin. Example: This organ is located behind the stomach."
        },
        {
            "id": "12",
            "word": "Bladder",
            "definition": "A hollow organ that stores urine before it is excreted. Example: This organ expands like a balloon as it fills."
        },
        {
            "id": "13",
            "word": "Diaphragm",
            "definition": "A dome-shaped muscle that helps with breathing by expanding the chest cavity. Example: You can feel this muscle working when you take a deep breath."
        },
        {
            "id": "14",
            "word": "Bronchi",
            "definition": "The two large tubes that branch off the trachea and lead to the lungs. Example: These tubes are part of the pathway for air entering the lungs."
        },
        {
            "id": "15",
            "word": "Pharynx",
            "definition": "The part of the throat that connects the mouth and nasal passages to the esophagus and larynx. Example: This is where food and air paths cross."
        },
        {
            "id": "16",
            "word": "Larynx",
            "definition": "The part of the throat that contains the vocal cords and produces sound. Example: This is often called the 'voice box.'"
        },
        {
            "id": "17",
            "word": "Spinal Cord",
            "definition": "A bundle of nerves running through the backbone that transmits signals between the brain and body. Example: Damage to this structure can cause paralysis."
        },
        {
            "id": "18",
            "word": "Cartilage",
            "definition": "A flexible connective tissue found in joints and other areas like the nose and ears. Example: This tissue prevents bones from rubbing directly against each other."
        },
        {
            "id": "19",
            "word": "Ligament",
            "definition": "Tissue that connects bones to other bones at joints. Example: A sprain occurs when this tissue is stretched or torn."
        },
        {
            "id": "20",
            "word": "Tendon",
            "definition": "Tissue that connects muscles to bones. Example: The Achilles tendon connects the calf muscle to the heel."
        },
        {
            "id": "21",
            "word": "Bone Marrow",
            "definition": "The soft tissue inside bones that produces blood cells. Example: Found in the hollow center of larger bones like the femur."
        },
        {
            "id": "22",
            "word": "Skin",
            "definition": "The body's largest organ, which protects against infection and helps regulate temperature. Example: It has layers like the epidermis and dermis."
        },
        {
            "id": "23",
            "word": "Reflex",
            "definition": "An automatic response to a stimulus, controlled by the nervous system. Example: Pulling your hand away from a hot stove."
        },
        {
            "id": "24",
            "word": "Sweat Glands",
            "definition": "Structures in the skin that produce sweat to help cool the body. Example: These glands are most active when you're exercising or in hot weather."
        },
        {
            "id": "25",
            "word": "Immune Response",
            "definition": "The body's reaction to harmful invaders like bacteria or viruses. Example: This can include producing antibodies."
        }
    ]
}
